# Built In Failures View Position Failures Cant Move Viewport Property

Source: https://www.revitapidocs.com/2026/c84c8f93-014c-2d18-073a-7cb867391917.htm

---

| Built In Failures View Position Failures Cant Move Viewport Property |
| --- |

Can't move Viewport when its placement is controlled by the assigned View Position.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static FailureDefinitionId CantMoveViewport { get; }
```

```
Public Shared ReadOnly Property CantMoveViewport As FailureDefinitionId
	Get
```

```
public:
static property FailureDefinitionId^ CantMoveViewport {
	FailureDefinitionId^ get ();
}
```

```
static member CantMoveViewport : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId See Also

#### Reference

BuiltInFailures ViewPositionFailures Class Autodesk.Revit.DB Namespace